## Terraform Plan Result
```
Acquiring state lock. This may take a few moments...
module.cdn.aws_acm_certificate.cf: Refreshing state... [id=arn:aws:acm:us-east-1:695394391597:certificate/4d4f0ec6-d842-4696-8adf-6ecbdc20fb8a]
module.cdn.aws_cloudfront_origin_access_control.oac: Refreshing state... [id=EPHGQ65P5I5H3]
module.ecr.aws_ecr_repository.app: Refreshing state... [id=testapp-dev-app]
module.vpc.aws_vpc.vpc: Refreshing state... [id=vpc-08d57ddcea586a1e5]
module.ecs.aws_cloudwatch_log_group.ecs: Refreshing state... [id=/ecs/testapp-dev-nginx]
module.iam.data.aws_iam_policy_document.ecs_task_assume_role: Reading...
module.ecs.aws_ecs_cluster.cluster: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:695394391597:cluster/testapp-dev-cluster]
module.ecs.aws_ecs_cluster.this: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:695394391597:cluster/testapp-dev-cluster]
module.ecs.aws_ecr_repository.app: Refreshing state... [id=testapp-dev-nginx]
module.iam.data.aws_iam_policy_document.ecs_task_assume_role: Read complete after 0s [id=1077804475]
module.networking.aws_acm_certificate.acm: Refreshing state... [id=arn:aws:acm:ap-northeast-1:695394391597:certificate/7432dd7d-6129-424b-aa46-4c624b81930a]
module.networking.aws_route53_zone.main: Refreshing state... [id=Z0632518T07Q6W1XR2EO]
module.cdn.aws_s3_bucket.cdn: Refreshing state... [id=testapp-dev-cdn-images]
module.vpc.aws_eip.nat_eip: Refreshing state... [id=eipalloc-0db35d82c9c88ad13]
module.waf.aws_wafv2_web_acl.waf: Refreshing state... [id=ac047f22-f824-4018-9850-e381cc7a67a4]
module.iam.aws_iam_role.ecs_task_role: Refreshing state... [id=testapp-dev-ecs-task-role]
module.iam.aws_iam_role.ecs_execution_role: Refreshing state... [id=testapp-dev-ecs-execution-role]
module.cdn.aws_route53_record.cf_validation["cdn.manno-cloud.com"]: Refreshing state... [id=Z0632518T07Q6W1XR2EO__18c801d97200c67cd00b5640210f275f.cdn.manno-cloud.com._CNAME]
module.cdn.aws_acm_certificate_validation.cf: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
module.iam.aws_iam_role_policy_attachment.ecs_execution_policy: Refreshing state... [id=testapp-dev-ecs-execution-role-20251122124510729500000002]
module.ecs.aws_ecs_task_definition.app: Refreshing state... [id=testapp-dev-task]
module.ecs.aws_ecs_task_definition.nginx: Refreshing state... [id=testapp-dev-nginx]
module.vpc.aws_subnet.public["public1"]: Refreshing state... [id=subnet-0ec526df05cca2c6f]
module.vpc.aws_internet_gateway.igw: Refreshing state... [id=igw-0d26b29494a6eb209]
module.vpc.aws_subnet.public["public2"]: Refreshing state... [id=subnet-00e4d05f10e97d2c8]
module.alb_ecs.aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:695394391597:targetgroup/testapp-ecs-tg/5374d2d49cecc727]
module.security_group.aws_security_group.security_group["alb_sg"]: Refreshing state... [id=sg-0bf1c2f9ce33fd2a7]
module.vpc.aws_subnet.private["private2"]: Refreshing state... [id=subnet-078820c8b956f920d]
module.vpc.aws_subnet.private["private1"]: Refreshing state... [id=subnet-02f9ee5dc20c3d9de]
module.alb.aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:695394391597:targetgroup/testapp-tg/c50fdf432d7d5f41]
module.security_group.aws_security_group.security_group["ecs_sg"]: Refreshing state... [id=sg-05c90a48b3ddc3f90]
module.security_group.aws_security_group.security_group["ec2_sg"]: Refreshing state... [id=sg-09968765736997df0]
module.security_group.aws_security_group.security_group["rds_sg"]: Refreshing state... [id=sg-05fe339695171b189]
module.security_group.aws_security_group.security_group["vpc_endpoint_sg"]: Refreshing state... [id=sg-0326e1b11956cb860]
module.vpc.aws_route_table.public: Refreshing state... [id=rtb-01675ee97f81afed7]
module.vpc.aws_nat_gateway.nat: Refreshing state... [id=nat-0de8a92282019dcf5]
module.cdn.aws_s3_bucket_public_access_block.cdn: Refreshing state... [id=testapp-dev-cdn-images]
aws_security_group_rule.vpc_endpoint_egress: Refreshing state... [id=sgrule-4233894472]
aws_security_group_rule.ec2_egress: Refreshing state... [id=sgrule-105943214]
aws_security_group_rule.allow_alb_to_ec2: Refreshing state... [id=sgrule-4260420028]
aws_security_group_rule.ecs_egress: Refreshing state... [id=sgrule-2347372450]
aws_security_group_rule.alb_ingress_https: Refreshing state... [id=sgrule-20275484]
aws_security_group_rule.alb_to_ec2: Refreshing state... [id=sgrule-2473151272]
aws_security_group_rule.vpc_endpoint_ingress: Refreshing state... [id=sgrule-3338211542]
aws_security_group_rule.allow_ec2_to_rds: Refreshing state... [id=sgrule-1072372100]
aws_security_group_rule.allow_alb_to_ecs: Refreshing state... [id=sgrule-700297913]
aws_security_group_rule.alb_ingress_http: Refreshing state... [id=sgrule-2483711300]
module.alb_ecs.aws_lb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:695394391597:loadbalancer/app/testapp-ecs-alb/9c8fc46ce3c672a4]
module.asg.aws_launch_template.lt: Refreshing state... [id=lt-002feb4931fe2689c]
module.alb.aws_lb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:695394391597:loadbalancer/app/testapp-alb/42afeaa52bac8d16]
module.vpc.aws_route_table.private: Refreshing state... [id=rtb-09673e168cd10a2e7]
module.vpc.aws_route_table_association.public["public1"]: Refreshing state... [id=rtbassoc-0f0e566c940b945d1]
module.vpc.aws_route_table_association.public["public2"]: Refreshing state... [id=rtbassoc-09efa4eb7a6cf30c4]
module.rds.aws_db_subnet_group.db_subnet_group: Refreshing state... [id=testapp-dev-db-subnet-group]
module.vpc_endpoint.aws_vpc_endpoint.interface["ecr.api"]: Refreshing state... [id=vpce-08eda1f1b89a4d35f]
module.vpc_endpoint.aws_vpc_endpoint.interface["ec2messages"]: Refreshing state... [id=vpce-0af88997b721d727e]
module.vpc_endpoint.aws_vpc_endpoint.interface["events"]: Refreshing state... [id=vpce-0efcf8c263d94e525]
module.vpc_endpoint.aws_vpc_endpoint.interface["sts"]: Refreshing state... [id=vpce-042d5323cc1f68479]
module.vpc_endpoint.aws_vpc_endpoint.interface["logs"]: Refreshing state... [id=vpce-085998c5ffcc6c374]
module.vpc_endpoint.aws_vpc_endpoint.interface["monitoring"]: Refreshing state... [id=vpce-011582f231043c17a]
module.vpc_endpoint.aws_vpc_endpoint.interface["ssm"]: Refreshing state... [id=vpce-057fd2c5e45d889e3]
module.vpc_endpoint.aws_vpc_endpoint.interface["ecr.dkr"]: Refreshing state... [id=vpce-018e467f0f246afd1]
module.vpc_endpoint.aws_vpc_endpoint.interface["ssmmessages"]: Refreshing state... [id=vpce-07ecb9c0125237019]
module.ecs.aws_ecs_service.nginx: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:695394391597:service/testapp-dev-cluster/testapp-dev-svc]
module.vpc.aws_route_table_association.private["private2"]: Refreshing state... [id=rtbassoc-0edc7e63494a28814]
module.vpc.aws_route_table_association.private["private1"]: Refreshing state... [id=rtbassoc-0310fbad057936b31]
module.asg.aws_autoscaling_group.asg: Refreshing state... [id=testapp-dev-asg]
module.alb.aws_lb_listener.https: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:695394391597:listener/app/testapp-alb/42afeaa52bac8d16/47eb46c3661ba822]
module.alb.aws_lb_listener.http_redirect: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:695394391597:listener/app/testapp-alb/42afeaa52bac8d16/65bcc107d4aecb50]
module.alb_ecs.aws_lb_listener.https: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:695394391597:listener/app/testapp-ecs-alb/9c8fc46ce3c672a4/c6bb8dcd6ba93305]
module.alb_ecs.aws_lb_listener.http_redirect: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:695394391597:listener/app/testapp-ecs-alb/9c8fc46ce3c672a4/68a9600592ed131c]
module.rds.aws_db_instance.dbinstance: Refreshing state... [id=db-CDA2HOVW42IHTZHCORD6CZKNTE]
module.vpc_endpoint.aws_vpc_endpoint.gateway["dynamodb"]: Refreshing state... [id=vpce-025930579f6fa5e18]
module.vpc_endpoint.aws_vpc_endpoint.gateway["s3"]: Refreshing state... [id=vpce-02c8cb8f1f59f1f5c]
module.cdn.aws_cloudfront_distribution.cdn: Refreshing state... [id=E1SEMKAAQXMRC2]
module.cdn.aws_route53_record.cdn_alias: Refreshing state... [id=Z0632518T07Q6W1XR2EO_cdn.manno-cloud.com_A]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.ecs.aws_ecs_service.app will be created
  + resource "aws_ecs_service" "app" {
      + availability_zone_rebalancing      = "DISABLED"
      + cluster                            = "arn:aws:ecs:ap-northeast-1:695394391597:cluster/testapp-dev-cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 50
      + desired_count                      = 2
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "testapp-dev-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = "arn:aws:ecs:ap-northeast-1:695394391597:task-definition/testapp-dev-task:3"
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "app"
          + container_port   = 80
          + target_group_arn = "arn:aws:elasticloadbalancing:ap-northeast-1:695394391597:targetgroup/testapp-ecs-tg/5374d2d49cecc727"
            # (1 unchanged attribute hidden)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-05c90a48b3ddc3f90",
            ]
          + subnets          = [
              + "subnet-02f9ee5dc20c3d9de",
              + "subnet-078820c8b956f920d",
            ]
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Warning: Reference to undefined provider

  on main.tf line 323, in module "cdn":
 323:     aws.us_east_1 = aws.us_east_1

There is no explicit declaration for local provider name "aws.us_east_1" in
module.cdn, so Terraform is assuming you mean to pass a configuration for
"hashicorp/aws".

If you also control the child module, add a required_providers entry named
"aws.us_east_1" with the source address "hashicorp/aws".

(and 2 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
<!-- Sticky Pull Request Commentterraform-plan -->